# Функція, яку ми інтегруємо
def f_1(x)
	return 1.0 / ((x + 1) * Math.sqrt(x**2 + 1))
 end
 
 # Метод прямоугольників для обчислення інтегралу
 def prm(a, b, n)
	h = (b - a) / n.to_f  # Розрахунок ширини кожного прямокутника
	integral_sum = 0.0
 
	# Сумуємо значення функції в середині кожного прямокутника
	(0...n).each do |i|
	  x_i = a + i * h + h / 2.0  # Середина прямокутника
	  integral_sum += f_1(x_i)
	end
 
	return h * integral_sum  # Повертаємо обчислене значення інтегралу
 end
 
 # Метод трапецій для обчислення інтегралу
 def trp(a, b, n)
	h = (b - a) / n.to_f  # Розрахунок ширини кожної трапеції
	integral_sum = (f_1(a) + f_1(b)) / 2.0  # Початкове значення суми
 
	# Сумуємо значення функції на вершинах трапецій
	(1...n).each do |i|
	  x_i = a + i * h  # Вершина трапеції
	  integral_sum += f_1(x_i)
	end
 
	return h * integral_sum  # Повертаємо обчислене значення інтегралу
 end
 
 # Границі та точність
 a_1 = 0.3
 b_1 = 0.8
 n = 1000
 
 # Виклик функцій для обчислення інтегралів
 result_prm = prm(a_1, b_1, n)
 result_trp = trp(a_1, b_1, n)
 
 # Виведення результатів
 puts "Результат методом прямоугольників: #{result_prm}"
 puts "Результат методом трапецій: #{result_trp}"
 